using System;
using System.Collections;
using System.Collections.Generic;

using UnityEngine;

namespace inonego.Pool
{
    // ============================================================
    /// <summary>
    /// 오브젝트 풀링을 위한 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IPool<T> where T : class
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 남아있는 오브젝트 목록입니다.
        /// </summary>
        // ------------------------------------------------------------
        public IReadOnlyCollection<T> Released { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 사용중인 오브젝트 목록입니다.
        /// </summary>
        // ------------------------------------------------------------
        public IReadOnlyCollection<T> Acquired { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 오브젝트가 사용중인지 여부를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool IsAcquired(T item);
        
        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 오브젝트가 반환된 상태인지 여부를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool IsReleased(T item);

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에서 오브젝트를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public T Acquire();
        
        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 오브젝트를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Release(T item, bool pushToReleased = true);

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 있는 모든 오브젝트를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void ReleaseAll(bool pushToReleased = true);

        // ------------------------------------------------------------
        /// <summary>
        /// 오브젝트를 풀에 추가합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void PushToReleased(T item);

        // -------------------------------------------------------------------------
        /// <summary>
        /// <br/>풀에 남아있는 오브젝트를 풀에서 제거하고 반환합니다.
        /// <br/>풀에 남아있는 오브젝트가 없으면 새로운 오브젝트를 생성하여 반환합니다.
        /// </summary>
        // -------------------------------------------------------------------------
        public T PopFromReleased();
        
        // -------------------------------------------------------------------------
        /// <summary>
        /// <br/>풀에 남아있는 오브젝트를 풀에서 제거하고 반환합니다.
        /// <br/>풀에 남아있는 오브젝트가 없으면 새로운 오브젝트를 생성하여 반환합니다.
        /// </summary>
        // -------------------------------------------------------------------------
        public Awaitable<T> PopFromReleasedAsync(Func<Awaitable<T>> acquireNewAsyncFunc);
    }
}