using System;
using System.Collections;
using System.Collections.Generic;

namespace inonego
{
    // ============================================================
    /// <summary>
    /// <br/>오브젝트 풀링을 위한 인터페이스입니다.
    /// <br/>Acquire, Release, ReleaseAll 메서드를 이용해주세요.
    /// </summary>
    // ============================================================
    public interface IPool<T>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 남아있는 오브젝트 목록입니다.
        /// </summary>
        // ------------------------------------------------------------
        IReadOnlyCollection<T> Released { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 사용중인 오브젝트 목록입니다.
        /// </summary>
        // ------------------------------------------------------------
        IReadOnlyCollection<T> Acquired { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 있는 오브젝트의 총 개수입니다.
        /// </summary>
        // ------------------------------------------------------------
        int TotalCount { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에서 오브젝트를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        T Acquire();

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 오브젝트를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        void Release(T item);

        // ------------------------------------------------------------
        /// <summary>
        /// 풀에 있는 모든 오브젝트를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        void ReleaseAll();
    }
}