using System;

namespace inonego
{
    // ===================================================================
    /// <summary>
    /// 읽기 전용 RangeValue 인터페이스입니다.
    /// </summary>
    // ===================================================================
    public interface IReadOnlyRangeValue<T> : IReadOnlyValue<T>, IComparable<T> where T : struct, IComparable<T>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 값을 제한하는 범위입니다.
        /// </summary>
        // ------------------------------------------------------------
        public IReadOnlyValue<MinMax<T>> Range { get; }
    
        // ------------------------------------------------------------
        /// <summary>
        /// 최소값입니다.
        /// </summary>
        // ------------------------------------------------------------
        public T Min { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 최대값입니다.
        /// </summary>
        // ------------------------------------------------------------
        public T Max { get; }
    }
}
