namespace inonego
{
    // ============================================================
    /// <summary>
    /// 읽기 전용 Value 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IReadOnlyValue<T> where T : struct
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 현재 값입니다.
        /// </summary>
        // ------------------------------------------------------------
        public T Current { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 현재 값이 변경될 때 발생하는 이벤트입니다.
        /// </summary>
        // ------------------------------------------------------------
        public event ValueChangeEvent<IReadOnlyValue<T>, T> OnCurrentChange;
    }
}
