using UnityEngine;

namespace inonego.Pool
{
    // ============================================================
    /// <summary>
    /// 게임 오브젝트를 생성하는 오브젝트 풀링을 위한 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IGOPool : IPool<GameObject>, IGameObjectProvider
    {

    #region 필드

        // ---------------------------------------------------------------------
        /// <summary>
        /// 게임 오브젝트를 생성하는데 사용하는 게임 오브젝트 프로바이더입니다.
        /// </summary>
        // ---------------------------------------------------------------------
        public IGameObjectProvider GameObjectProvider { get; }

        // ---------------------------------------------------------------------
        /// <summary>
        /// Release되는 경우 게임 오브젝트가 Pool의 하위에 위치합니다.
        /// </summary>
        // ---------------------------------------------------------------------
        public Transform Pool { get; set; }

    #endregion

    }
}