using System;

namespace inonego
{
    // ============================================================
    /// <summary>
    /// 보드의 포인트를 나타내는 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IBoardPoint<TVector, TIndex>
    where TVector : struct where TIndex : struct
    {
        //------------------------------------------------------------
        /// <summary>
        /// 벡터를 반환합니다.
        /// </summary>
        //------------------------------------------------------------
        public TVector Vector { get; }

        //------------------------------------------------------------
        /// <summary>
        /// 인덱스를 반환합니다.
        /// </summary>
        //------------------------------------------------------------
        public TIndex Index { get; }
    }
}