using System;

namespace inonego.Modifier
{
    // ============================================================
    /// <summary>
    /// 값을 수정하는 수정자의 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IModifier<T> : IDeepCloneable<IModifier<T>>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 수정자가 값을 수정하여 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public T Modify(T value);
    }
}