namespace inonego
{
    // ========================================================================
    /// <summary>
    /// 매개변수를 초기화해야 하는 객체를 위한 인터페이스입니다.
    /// </summary>
    // ========================================================================
    public interface INeedToInit
    {
        public void Init();
    }

    // ========================================================================
    /// <summary>
    /// 매개변수를 초기화해야 하는 객체를 위한 인터페이스입니다.
    /// </summary>
    // ========================================================================
    public interface INeedToInit<TParam>
    {
        public void Init(TParam param);
    }
}