using System;

using UnityEngine;

namespace inonego
{
    public interface IGroundChecker
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 이벤트를 호출할지 여부를 결정합니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool InvokeEvent { get; set; }

        // ------------------------------------------------------------
        /// <summary>
        /// 현재 바닥에 있는지 여부를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool IsOnGround { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥이 가지고 있는 속도를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public Vector3 GroundVelocity { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 중력의 벡터 값을 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public Vector3 Gravity { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥에 착지했을 때 이벤트를 발생시킵니다.
        /// </summary>
        // ------------------------------------------------------------
        public event ValueChangeEvent<IGroundChecker, GameObject> OnLand;

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥을 벗어났을 때 이벤트를 발생시킵니다.
        /// </summary>
        // ------------------------------------------------------------
        public event ValueChangeEvent<IGroundChecker, GameObject> OnLeave;

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥 체크를 위한 업데이트를 진행합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Check();
    }
}