using UnityEngine;

namespace inonego
{
   // ========================================================================
   /// <summary>
   /// 게임 오브젝트를 생성하여 가져오거나 반환하도록 도와주는 인터페이스입니다.
   /// </summary>
   // ========================================================================
   public interface IGameObjectProvider
   {

   #region 필드

      // ------------------------------------------------------------
      /// <summary>
      /// <br/>게임 오브젝트를 생성할 위치입니다.
      /// <br/>null인 경우, 루트에 생성됩니다.
      /// </summary>
      // ------------------------------------------------------------
      public Transform Parent { get; set; }

      // ------------------------------------------------------------
      /// <summary>
      /// 게임 오브젝트를 생성할 위치를 유지할지에 대한 여부입니다.
      /// </summary>
      // ------------------------------------------------------------
      public bool WorldPositionStays { get; set; }

   #endregion

   #region 메서드

      // ------------------------------------------------------------
      /// <summary>
      /// 게임 오브젝트를 가져옵니다.
      /// </summary>
      // ------------------------------------------------------------
      public GameObject Acquire();

      // ------------------------------------------------------------
      /// <summary>
      /// 게임 오브젝트를 반환합니다.
      /// </summary>
      // ------------------------------------------------------------
      public void Release(GameObject target);

      // ------------------------------------------------------------
      /// <summary>
      /// 게임 오브젝트를 비동기로 가져옵니다.
      /// </summary>
      // ------------------------------------------------------------
      public Awaitable<GameObject> AcquireAsync();

   #endregion

   }
}