using System;

using UnityEngine;

namespace inonego
{    
    // ==================================================================
    /// <summary>
    /// 읽기 전용 더티 플래그 인터페이스입니다.
    /// </summary>
    // ==================================================================
    public interface IDirtyFlag
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 더티 플래그가 설정되어 있는지 여부를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        bool IsDirty { get; }
    }

    // ==================================================================
    /// <summary>
    /// 더티 플래그용 클래스입니다.
    /// </summary>
    // ==================================================================
    [Serializable]
    public class DirtyFlag : IDirtyFlag
    {
        [SerializeField]
        private bool isDirty = false;
        
         // ------------------------------------------------------------
        /// <summary>
        /// 더티 플래그가 설정되어 있는지 여부를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool IsDirty => isDirty;

        // ------------------------------------------------------------
        /// <summary>
        /// 더티 플래그를 설정합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void SetDirty() => isDirty = true;

        // ------------------------------------------------------------
        /// <summary>
        /// 더티 플래그를 초기화합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Clear() => isDirty = false;
    }
}
